Autodesk.Revit.DB.Electrical.IAnalyticalCurrentCalculationServer.Calculate(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.AnalyticalCurrentCalculationData)
Calculate the current of an analytical distribution system
Returns:
Returns true if the calculation finished successfully, false otherwise.

Autodesk.Revit.DB.Electrical.IAnalyticalCurrentCalculationServer
Interface class for external servers implementing analytical current calculation.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.